#include <iostream>
#include <cmath>
int main(){
    //Вывести на экран ряд натуральных чисел от Н до М с шагом Ш.
    //Например, если Н=10, М=35, Ш=5, то вывод должен быть таким: 10 15 20 25 30 35.
    //ЗначенияН, М, Ш указываются пользователем (считываются с клавиатурыили из файла)

    float n, m, sh;

    std::cout << "Введите диапозон(начальное и конечное значение): ";
    std::cin>>n>>m;
    std::cout << "Введите шаг: ";
    std::cin>>sh;

    while (n <= m){
        n += sh;
        std::cout <<n <<std::endl;

    }
    return 0;
}
