#include <iostream>

using namespace std;

int main()
{
    //1.Вывести на экран Первую букву имени из символов "*" (звездочка)
    cout << "   **   " << endl
         << "  *  *  " << endl
         << " ****** " << endl
         << "*      *" << endl;
}
